Autodesk.Revit.DB.ScheduleField.IsCustomFieldWithValidServer
Identifies if this is a Autodesk.Revit.DB.ScheduleFieldType.CustomField
and if there is added an instance of a Autodesk.Revit.DB.ICustomFieldServer to the custom field service.
Returns:
Returns true if this is a Autodesk.Revit.DB.ScheduleFieldType.CustomField
and if there is added an instance of a Autodesk.Revit.DB.ICustomFieldServer to the custom field service.
Since:
2013

Autodesk.Revit.DB.ScheduleField.GetSpecTypeId
The spec describing values of this field, if applicable.
Returns:
Identifier of the spec, or empty if the field does not represent a number with units.
Since:
2013

Autodesk.Revit.DB.ScheduleField.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class.
Remarks:
See the UnitType property to determine the unit type of this field.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The display unit in formatOptions is not a valid display unit for the unit type of this ScheduleField, or the rounding method in formatOptions is not set to Nearest.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ScheduleField.SetStyle(Autodesk.Revit.DB.TableCellStyle)
Sets the style of this field.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.ScheduleField.CreatesCircularReferences(Autodesk.Revit.DB.ScheduleFieldId)
Checks whether a field ID would create a circular chain of references
when used by the PercentageOf property of this field.
fieldId:
The field ID to check.
Returns:
True if the field ID would create a circular chain of references,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fieldId is not InvalidScheduleFieldId or the ID of a field that can be
used to calculated percentages.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleField.SetCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Sets this field's combine parameter array if applicable
data:
data is array of TableCellCombinedParameterData to be set as combined parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.ScheduleField.IsValidCombinedParameters(System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Checks if data is valid for combined parameters
data:
data is array of TableCellCombinedParameterData to be set as combined parameters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.ScheduleField.GetCustomFieldData
Gets the data associated with this custom field. If this field isn't a Autodesk.Revit.DB.ScheduleFieldType.CustomField will return null.
Returns:
Returns the data associated with this custom field. If this field isn't a Autodesk.Revit.DB.ScheduleFieldType.CustomField will return null.
Since:
2024

Autodesk.Revit.DB.ScheduleField.MultipleValuesCustomText
The custom multiple values text to be used when the schedule field displays multiple element values,
used when Autodesk.Revit.DB.ScheduleField.MultipleValuesDisplayType is set to Autodesk.Revit.DB.ScheduleFieldMultipleValuesDisplayType.Custom.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2022

Autodesk.Revit.DB.ScheduleField.MultipleValuesText
The multiple values text to be used when the schedule field displays multiple element values,
as specified by the display type Autodesk.Revit.DB.ScheduleField.MultipleValuesDisplayType.
Since:
2022

Autodesk.Revit.DB.ScheduleField.MultipleValuesDisplayType
Determines the type of multiple value indication to be used
when the schedule field displays multiple element values.
Remarks:
The default display type is Autodesk.Revit.DB.ScheduleFieldMultipleValuesDisplayType.Project,
indicating that the project Autodesk::Revit::DB::MultipleValuesIndicationSettings::Value setting will be used.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2022

Autodesk.Revit.DB.ScheduleField.VerticalAlignment
The vertical alignment of the column's data.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2024

Autodesk.Revit.DB.ScheduleField.HorizontalAlignment
The horizontal alignment of the column's data.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.ScheduleField.ColumnHeading
The column heading text.
Remarks:
On initial creation of a ScheduleField, the column heading is
initialized based on the field name (typically a parameter name).
The heading text.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.ScheduleField.PercentageBy
The ID of the grouped schedule field used to calculate percentage totals.
Remarks:
A Percentage field calculates what percent of the total of another field
each element represents.  If PercentageBy is InvalidScheduleFieldId,
the total is of all elements in the schedule.  If PercentageBy is the
ID of one of the fields that the schedule is grouped by, the total is
of all elements in that group.
InvalidElementId or the ID of the grouped field.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: percentageBy is not InvalidScheduleFieldId or the ID of a field that the
schedule is grouped by.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleField is not a percentage field.
Since:
2013

Autodesk.Revit.DB.ScheduleField.PercentageOf
The ID of the field to calculate percentages of.
Remarks:
A Percentage field calculates what percent of the total of another field
each element represents.  PercentageOf is the ID of the field used to
calculate percentages.  If PercentageOf is InvalidScheduleFieldId,
no data is displayed.
Percentages can only be calculated for numeric fields.  The Count
field and other percentage fields cannot be used to calculate percentages.
The ID of the field, or InvalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: percentageOf is not InvalidScheduleFieldId or the ID of a field that can be
used to calculated percentages.
-or-
When setting this property: percentageOf would create a circular chain of references.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This ScheduleField is not a percentage field.
Since:
2013

Autodesk.Revit.DB.ScheduleField
A field in a schedule.
Remarks:
The ScheduleField class represents a single field in a ScheduleDefinition's
list of fields.  Each (non-hidden) field becomes a column in the schedule.
Most commonly, a field represents an instance or type parameter of
elements appearing in the schedule.  Some fields represent parameters
of other related elements, like the room that a scheduled element belongs to.
Fields can also represent data calculated from other fields in the schedule,
specifically Formula and Percentage fields.
Another type of field is Custom Field. For this one, the value for each row is
computed based on the (sub)elements that are grouped on that row and can have a
graphic representation when the schedule is placed on a sheet.
Since:
2013